src/cf/Documents/fmBudget.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>fmBudget</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.fmCashflowBudget</xr:Item>
				<xr:Item>AccumulationRegister.fmIncomesAndExpenses</xr:Item>
				<xr:Item>AccountingRegister.fmBudgeting</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>BalanceUnit</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.fmBalanceUnits</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Department</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.fmDepartments</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Scenario</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.fmBudgetingScenarios</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>BeginOfPeriod</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Responsible</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Users</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>InfoStructure</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.fmInfoStructures</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>FillingParameters</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>TotalAmount</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Project</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.fmProjects</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>OperationType</Name>
					<Type>
						<v8:Type>cfg:EnumRef.fmBudgetOperationTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Comment</Name>
					<Comment>Комментарий</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Currency</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Currencies</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ActualVersion</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AgreementRoute</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.fmAgreementRoutes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Allocation</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>BudgetsData</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Period</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>RecordType</Name>
							<Type>
								<v8:Type>cfg:EnumRef.fmBudgetFlowOperationTypes</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Item</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.fmIncomesAndExpensesItems</v8:Type>
								<v8:Type>cfg:CatalogRef.fmCashflowItems</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>CorItem</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.fmIncomesAndExpensesItems</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>CorDepartment</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.fmDepartments</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Amount</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Analytics1</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.fmAnalyticsTypes</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Analytics2</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.fmAnalyticsTypes</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Analytics3</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.fmAnalyticsTypes</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>VersionPeriod</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>CorBalanceUnit</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.fmBalanceUnits</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>CorProject</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.fmProjects</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>AllocationStep</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.fmBudgetDistributionSteps</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Comment</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>CurrencyRates</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Period</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Rate</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Repetition</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/InformationRegisters/fmResponsiblesReplacements.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>fmResponsiblesReplacements</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Responsible</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Users</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ResponsibleReplacing</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Users</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>BeginDate</Name>
					<Comment>Дата начала действия замены</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>EndDate</Name>
					<Comment>Дата окончания действия замены</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/fmRouteStates.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>fmRouteStates</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>PointState</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.fmRoutePointsStates</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Responsible</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Users</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Comment</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Document</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.fmAgreeDocumentTypes</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Version</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>AgreementRoute</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.fmAgreementRoutes</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>RoutePoint</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.fmRoutesPoints</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Department</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.fmDepartments</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Catalogs/fmRoutePointsStates.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Catalog>
		<Properties>
			<Name>fmRoutePointsStates</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.fmRoutesPoints</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ColorType</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Green</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Red</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Blue</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Color</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>StageCompleted</Name>
					<Comment>0 - этап отклонен; 1 - этап согласован; 2 - согласование прекращено;</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>State</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.fmDocumentState</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ColorStorage</Name>
					<Comment>Цвет хранилище</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ReturnPoint</Name>
					<Comment>Точка возврата на предыдущий уровень</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.fmRoutesPoints</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>TransitionPoint</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.fmRoutesPoints</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Documents/fmBudget/Forms/ListForm/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

&AtServer
// Процедура отклонения маршрута 
//
Procedure RejectServer(VAL SelectedRows, Comment = "")
	
	For Each String In SelectedRows Do
		If String = Undefined OR TypeOf(String) = Type("DynamicalListGroupRow") Then 
			Continue;
		EndIf;
		fmProcessManagement.RejectDocument(String, String.AgreementRoute, Comment);
	EndDo;
	
EndProcedure //ОтклонитьСервер()

&AtServer
// Процедура согласования маршрута по всем точкам
//
Procedure AgreeServer(VAL SelectedRows, Comment = "")
	
	For Each String In SelectedRows Do
		If String = Undefined OR TypeOf(String) = Type("DynamicalListGroupRow") Then 
			Continue;
		EndIf;
		fmProcessManagement.AgreeDocumentByAllPoints(String, String.AgreementRoute, Comment);
	EndDo;
	
EndProcedure

&AtServerNoContext
Function GetAgreementDocuments()
	
	Query = New Query("SELECT
	|	fmResponsiblesReplacements.Responsible AS Responsible
	|INTO TTReplacements
	|FROM
	|	InformationRegister.fmResponsiblesReplacements AS fmResponsiblesReplacements
	|WHERE
	|	fmResponsiblesReplacements.ResponsibleReplacing = &Responsible
	|	AND (fmResponsiblesReplacements.BeginDate <= &CurrentDate
	|			OR fmResponsiblesReplacements.BeginDate = DATETIME(1, 1, 1, 0, 0, 0))
	|	AND (fmResponsiblesReplacements.EndDate >= &CurrentDate
	|			OR fmResponsiblesReplacements.EndDate = DATETIME(1, 1, 1, 0, 0, 0))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|SELECT ALLOWED
	|	fmRouteStates.Document AS Document
	|FROM
	|	InformationRegister.fmRouteStates AS fmRouteStates
	|WHERE
	|	fmRouteStates.Responsible = &Responsible
	|	AND fmRouteStates.PointState = Value(Catalog.fmRoutePointsStates.EmptyRef)
	|
	|GROUP BY
	|	fmRouteStates.Document
	|
	|UNION ALL
	|
	|SELECT
	|	fmRouteStates.Document
	|FROM
	|	InformationRegister.fmRouteStates AS fmRouteStates
	|WHERE
	|	fmRouteStates.Responsible IN
	|			(SELECT
	|				TTReplacements.Responsible AS Responsible
	|			FROM
	|				TTReplacements AS TTReplacements)
	|	AND fmRouteStates.PointState = Value(Catalog.fmRoutePointsStates.EmptyRef)
	|
	|GROUP BY
	|	fmRouteStates.Document");
	Query.SetParameter("Responsible", Users.CurrentUser());
	Query.SetParameter("CurrentDate", CurrentSessionDate());
	Return Query.Execute().Unload().UnloadColumn("Document");
	
EndFunction


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
	fmCommonUseServer.SetFilterByMainBalanceUnit(ThisForm);
	
	StatesColoring = Catalogs.fmDocumentState.GetSettings();
	For Each Item In StatesColoring Do
		fmCommonUseClientServer.AddConditionalAppearanceItem("List", ConditionalAppearance, "List.State",, Item.Ref, Item.Color, "TextColor");
	EndDo;
	
	// Настройка видимости кнопок согласования.
	If GetAgreementDocuments().Count()=0 Then
		Items.Agreement.Visible = False;
		Items.AgreeForm.Visible = False;
		Items.DocumentsForAgreement.Visible = False;
	EndIf;
	
EndProcedure

&AtServer
Procedure ListBeforeLoadUserSettingsAtServer(Item, Settings)
	fmCommonUseServer.RestoreListFilter(List, Settings, "BalanceUnit");
EndProcedure

&AtClient
Procedure NotificationProcessing(EventName, Parameter, Source)
	If EventName = "fmListRefresh" Then 
		Items.List.Refresh();
		DocumentsForAgreementOnChange(Undefined);
	EndIf;
EndProcedure


/////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД

&AtClient
Procedure Reject(Command)
	RejectServer(Items.List.SelectedRows);
	Notify("fmListRefresh");
EndProcedure

&AtClient
Procedure RejectWithComment(Command)
	OpenForm("CommonForm.fmCommentForm", , , , , , New NotifyDescription("RejectWithCommentEnd", ThisObject), FormWindowOpeningMode.LockOwnerWindow);
EndProcedure

&AtClient
Procedure RejectWithCommentEnd(Result, AdditionalParameters) Export
	If Result <> Undefined Then
		RejectServer(Items.List.SelectedRows, Result);
		Notify("fmListRefresh");
	EndIf;
EndProcedure // ОтклонитьСКомментарием()

&AtClient
Procedure Agree(Command)
	AgreeServer(Items.List.SelectedRows);
	Notify("fmListRefresh");
EndProcedure

&AtClient
Procedure AgreeWithComment(Command)
	OpenForm("CommonForm.fmCommentForm", , , , , , New NotifyDescription("AgreeWithCommentEnd", ThisObject), FormWindowOpeningMode.LockOwnerWindow);
EndProcedure

&AtClient
Procedure AgreeWithCommentEnd(Result, AdditionalParameters) Export
	If Result <> Undefined Then
		AgreeServer(Items.List.SelectedRows, Result);
		Notify("fmListRefresh");
	EndIf;
EndProcedure // СогласоватьСКомментарием()

&AtClient
Procedure DocumentsForAgreementOnChange(Item)
	If DocumentsForAgreement Then
		fmCommonUseClientServer.ChangeListFilterItem(List, "Ref", GetAgreementDocuments(), True, DataCompositionComparisonType.InList);
	Else
		fmCommonUseClientServer.ChangeListFilterItem(List, "Ref");
	EndIf;
EndProcedure
